{"class_name": "Sequential", "keras_version": "2.0.4", "config": [{"class_name": "Lambda", "config": {"function": ["c\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000\u0005\u0000\u0000\u0000C\u0000\u0000\u0000sW\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000d\u0001\u0000d\u0002\u0000d\u0003\u0000g\u0003\u0000d\u0004\u0000t\u0000\u0000j\u0002\u0000\u0083\u0001\u0001j\u0003\u0000d\u0005\u0000d\u0006\u0000d\u0006\u0000\u0083\u0003\u0000}\u0001\u0000|\u0000\u0000|\u0001\u0000\u0018}\u0000\u0000|\u0000\u0000d\u0007\u0000d\u0007\u0000\u0085\u0002\u0000d\u0007\u0000d\u0007\u0000d\b\u0000\u0085\u0003\u0000f\u0002\u0000\u0019S(\t\u0000\u0000\u0000s!\u0000\u0000\u0000\n    Mean value of RGB value\n    g\u00ecQ\u00b8\u001e\u0085\u00eb^@g`\u00e5\u00d0\"\u00db1]@gj\u00bct\u0093\u0018\u00fcY@t\u0005\u0000\u0000\u0000dtypei\u0003\u0000\u0000\u0000i\u0001\u0000\u0000\u0000Ni\u00ff\u00ff\u00ff\u00ff(\u0004\u0000\u0000\u0000t\u0002\u0000\u0000\u0000npt\u0005\u0000\u0000\u0000arrayt\u0007\u0000\u0000\u0000float32t\u0007\u0000\u0000\u0000reshape(\u0002\u0000\u0000\u0000t\u0001\u0000\u0000\u0000xt\b\u0000\u0000\u0000vgg_mean(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\u000f\u0000\u0000\u0000vgg16Shabeer.pyt\u000e\u0000\u0000\u0000vgg_preprocess\r\u0000\u0000\u0000s\u0006\u0000\u0000\u0000\u0000\u00040\u0001\n\u0001", null, null], "name": "lambda_2", "dtype": "float32", "trainable": false, "function_type": "lambda", "arguments": {}, "batch_input_shape": [null, 3, 224, 224], "output_shape": [3, 224, 224], "output_shape_type": "raw"}}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": false, "name": "zero_padding2d_14", "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_14", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": false, "data_format": "channels_first", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": false, "name": "zero_padding2d_15", "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_15", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": false, "data_format": "channels_first", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_6", "trainable": false, "data_format": "channels_first", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": false, "name": "zero_padding2d_16", "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_16", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": false, "data_format": "channels_first", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": false, "name": "zero_padding2d_17", "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_17", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": false, "data_format": "channels_first", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_7", "trainable": false, "data_format": "channels_first", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": false, "name": "zero_padding2d_18", "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_18", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": false, "data_format": "channels_first", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": false, "name": "zero_padding2d_19", "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_19", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": false, "data_format": "channels_first", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": false, "name": "zero_padding2d_20", "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_20", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": false, "data_format": "channels_first", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_8", "trainable": false, "data_format": "channels_first", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": false, "name": "zero_padding2d_21", "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_21", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": false, "data_format": "channels_first", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": false, "name": "zero_padding2d_22", "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_22", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": false, "data_format": "channels_first", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": false, "name": "zero_padding2d_23", "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_23", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": false, "data_format": "channels_first", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_9", "trainable": false, "data_format": "channels_first", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": false, "name": "zero_padding2d_24", "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_24", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": false, "data_format": "channels_first", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": false, "name": "zero_padding2d_25", "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_25", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": false, "data_format": "channels_first", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": false, "name": "zero_padding2d_26", "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_26", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": false, "data_format": "channels_first", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_10", "trainable": false, "data_format": "channels_first", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": false, "name": "flatten_2"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_5", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": false, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 4096, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": false, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_6", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": false, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 4096, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": false, "name": "dropout_4"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_8", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "use_bias": true, "activity_regularizer": null}}], "backend": "theano"}